app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
						    <% end %>
						    <%= @book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
						    <% end %>
						      <%= @book.favorites.count %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
---
					<td>
						コメント数：<%= @book.book_comments.count %>