app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "魚図鑑"], ["body", "魚の本です"], ["user_id", 1], ["created_at", "2019-12-26 12:48:29.107571"], ["updated_at", "2019-12-26 12:48:29.107571"]]
SELECT "books".* FROM "books"
---
  def create
  	@book = current_user.books.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
  	if @book.save #入力されたデータをdbに保存する。
  		redirect_to book_path(@book.id), notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all