app/controllers/book_comments_controller.rb

	def create
		book = Book.find(params[:book_id])
		book_comment = current_user.book_comments.new(book_comment_params)
		book_comment.book_id = book.id
		book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "book_comments" ("coment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["coment", ""], ["user_id", 2], ["book_id", 3], ["created_at", "2019-12-24 09:54:35.211966"], ["updated_at", "2019-12-24 09:54:35.211966"]]

	def destroy
		book_comment = current_user.book_comments.find(params[:id])
		book_comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."user_id" = ? AND "book_comments"."id" = ? LIMIT ?  [["user_id", 1], ["id", nil], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 11]]