app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "9e79edd9136e70314c85306b5185055119fe7fa3e601462aaff06e3bfdd8"], ["updated_at", "2019-12-23 14:10:04.393518"], ["id", 2]]
---
  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)